examples/tobias_tutorial/meshing_a_helix/templates/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1900;

boundaryField
{
    inlet	
    {
        type            compressible::turbulentMixingLengthFrequencyInlet;
        mixingLength    0.00252;
        value           $internalField; 
    }
    
	atmosphere
    {
        type            zeroGradient;
    }
    
    wall 
    {
        type            compressible::omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
