examples/tobias_tutorial/meshing_a_helix/templates/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-6;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.05;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0.1;
    }

    "(U|h|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-9;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 20;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.1;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.0;
    pRefCell        0;
    pRefValue       1e5;

    residualControl
    {

        p   
        { relTol 0; tolerance 5e-5; }
        U   
        { relTol 0; tolerance 1e-4; }
        h   
        { relTol 0; tolerance 5e-5; }
    }
}

relaxationFactors
{
    fields
    {
        p               0.4;
        pFinal          1;
    }
    equations
    {
        U           0.6;
        h           0.5;
        k           0.7;
        epsilon     0.7;
        omega       0.7;

        UFinal      1;
        hFinal      1;
        kFinal      1;
        omegaFinal  1;
        epsilonFinal 1;
    }
}


// ************************************************************************* //
